<?php
// $Id: finish.php,v 1.1 2007/05/15 02:34:22 minahito Exp $
$content =
"<h3><u> نصب XOOPS Cube ( قدم آخر)</u></h3>
<p>مرحله اول نصب XOOPS Cube به پایان رسیده است . شما با کیلیک بر روی دکمه بعدی وارد مرحله نصب ماژول ها میشوید.</p>
<p>بر روی دکمه [بعدی] کیلک کنید, و شما صفحه ورود را میبینید. لطفا برای ورود از اکانت وب مسترسی که در مرحله اول نصب ساخته اید استفاده کنید .</p>
<p>بعد از ورود .لیست ماژول های که میتوانید آنها را نصب کنید مشاهده میکنید . ماژول های را که میخواهید آنها را نصب کنید انتخواب کرده و بر روی دکمه 'نصب' کیلیک کنید.</p>
<p>ماژول های انتخواب شده به طور اتوماتیک نصب میشود, بعد از این مرحله صفحه اصلی XOOPS Cube ظاهر میشود و شما برای ادامه کار آماده اید</p>

<u><b>روش استفاده</b></u>
<p>[هنوز چیزی نوشته نشده]</p>

<u><b>پشتیبانی</b></u>
<p>برای پشتیبانی بیشتر به<a href='http://xoopscube.sourceforge.net/' target='_blank'>XOOPS Cube Project</a> مراجعه کنید</p>
";
?>