<?php
// $Id: install.php,v 1.1 2007/05/15 02:34:22 minahito Exp $
define("_INSTALL_L0","به نصب جادویی XOOPS Cube 2.1 خوش آمدید");
define("_INSTALL_L70","لطفا سطح دسترسی بع فایل  mainfile.php را طوری تغییر دهید كه قابل نوشتن در سرور باشد. (مثال:  chmod 777 mainfile.php بر روی سرور های UNIX/LINUX , یا در properties نگاه كنید كه گزینه read-only انتخاب نشده باشد در سرور های ویندوز ). این صفحه رو هر وقت سطح دسترسی را درست كردید reload كنید.");
//define("_INSTALL_L71","رو دکمه زیر بزنید تا نصب آغاز شود.");
define("_INSTALL_L1","فایل mainfile.php را با یک ادیتور متنی باز کرده و کد زیر را در خط 31 پیدا کنید:");
define("_INSTALL_L2","حالا این خط را به زیری عوض کنید:");
define("_INSTALL_L3","سپس در خط 35  %s را به  %s عوض کنید");
define("_INSTALL_L4","خب حالا که این کار ها را انجام دادید دوباره تلاش کنید");
define("_INSTALL_L5","هشدار!");
define("_INSTALL_L6","یک اختلاف بین تنظیمات XOOPS_ROOT_PATH در خط 31 فایل mainfile.php و اطلاعات مسیر ریشه یافت شد.");
define("_INSTALL_L7","تنظیمات شما: ");
define("_INSTALL_L8","ما یافتیم: ");
define("_INSTALL_L9","( در سیستم عامل های مایکروسافت شما ممکن است حتی وقتی تنظیماتتتان درست باشد این خطا را مشاهده کنید.اگر اینطور بودلطفا دکمه زیر را برای ادامه بزنید)");
define("_INSTALL_L10","لطفا دکمه زیر را برای ادامه بزنید اگر واقعا همه چیز درست است.");
define("_INSTALL_L11","مکان فایل ها در ریشه سایت شما: ");
define("_INSTALL_L12","آدرس سایت شما که ریشه را نشان می دهد: ");
define("_INSTALL_L13","اگر تنظیمات بالا درست هستند لطفا دکمه زیر را برای ادامه بزنید.");
define("_INSTALL_L14","بعدی");
define("_INSTALL_L15","لطفا فایل  mainfile.php را باز کنید و نیازمندی های پایگاه داده را وارد کنید");
define("_INSTALL_L16","%s hostname پایگاه داده شماست");
define("_INSTALL_L17","%s username پایگاه داده شماست");
define("_INSTALL_L18","%s password پایگاه داده شماست");
define("_INSTALL_L19","%s نام پایگاه داده شماست که جدول ها در آن قرار می گیرند");
define("_INSTALL_L20","%s  prefix جدول هاست که در حین نصب قرار داده می شود");
define("_INSTALL_L21","پایگاه داده مقابل در سرور پیدا نشد:");
define("_INSTALL_L22","ساخته شود؟");
define("_INSTALL_L23","بله");
define("_INSTALL_L24","نه");
define("_INSTALL_L25","ما اطلاعات زیر را در فایل mainfile.php  پیدا کردیم. لطفا اگر درست نیستند آنها را اصلاح کنید.");
define("_INSTALL_L26","تنظیمات پایگاه داده ");
define("_INSTALL_L51","پایگاه داده");
define("_INSTALL_L66","پایگاه داده را برای استفاده انتخاب کنید");
define("_INSTALL_L27","Hostname پایگاه داده");
define("_INSTALL_L67","Hostname پایگاه داده در سرور. اگر مطمان نیستید که چه چیزی باید وارد کنید, 'localhost' را انتخاب کنید و در بیشتر موارد درست خواهد بود.");
define("_INSTALL_L28","Username پایگاه داده");
define("_INSTALL_L65","شناسه کاربری پایگاه داده شما در سرور");
define("_INSTALL_L29","Name پایگاه داده");
define("_INSTALL_L64","نام پایگاه داده در سرور. نصب کننده زوپس تلاش خواهد کرد که اگر پایگاه داده ای وجود نداشت یکی بسازد.");
define("_INSTALL_L52","Password پایگاه داده");
define("_INSTALL_L68","واژه رمز برای شناسه کاربری پایگاه داده شما");
define("_INSTALL_L30","پیشوند جدول ها (Table Prefix)");
define("_INSTALL_L63","این پیشوند به اول تمام جدول ها اضافه خواهد شد تا از ناسازگاری اسامی در پایگاه های داده مختلف در سرور جلوگیری شود. اگر از انتخاب آن مطمان نیستید میتوانید از گزینه پیشفرض آن  استفاده کنید.");
define("_INSTALL_L54","اتصال پایا به کار رود؟");
define("_INSTALL_L69","پیشفرض آن 'نه' است. اگر مطمان نیستید همین 'نه' را انتخاب کنید.");
define("_INSTALL_L55","XOOPS Physical Path");
define("_INSTALL_L59","مکان فیزیکی شاخه اصلی زوپس بدون داشتن اسلش در اول آن");
define("_INSTALL_L56","XOOPS Virtual Path (URL)");
define("_INSTALL_L58","مکان مجازی (آدرس سایت) شاخه اصلی زوپس بدون داشتن اسلش در اول آن");

define("_INSTALL_L31","نا توانی در ساختن پایگاه داده. برای جزییات بیشتر با مسئول سرور خود تماس بگیرید..");
define("_INSTALL_L32","نصب به اتمام رسید.");
define("_INSTALL_L33","روی <a href='../index.php'>این لینک</a> کلیک کنید تا صفحه اول سایت خود را ببینید.");
define("_INSTALL_L35","اگر هر خطایی در حین نصب مشاهده کردید لطفا با تیم توسعه زوپس در <a href='http://xoopscube.org/' target='_blank'>xoopscube.org/</a> تماس بگیرید.");
define("_INSTALL_L36","لطفا شناسه کاربری و واژه رمز را برای  وب مستر سایت انتخاب کنید.");
define("_INSTALL_L37","شناسه کاربری وب مستر");
define("_INSTALL_L38","ایمیل وب مستر");
define("_INSTALL_L39","واژه رمز وب مستر");
define("_INSTALL_L74","تکرار واژه رمز وب مستر");
define("_INSTALL_L40","ساختن جدول ها");
define("_INSTALL_L41","لطفا برگردید و مواردی را که لازم است تکمیل کنید.");
define("_INSTALL_L42","بازگشت");
define("_INSTALL_L57","لطفا %s را وارد کنید.");

// %s is database name
define("_INSTALL_L43","پایگاه داده %s ساخته شد!");

// %s is table name
define("_INSTALL_L44","ناتوانی در ساخت جدول %s ");
define("_INSTALL_L45","جدول %s ساخته شد.");

define("_INSTALL_L46","برای اینکه ماژول های موجود در این بسته کار کنند فایل های نوشته شده در ادامه این متن باید قابل نوشتن در سرور باشند.لطفا سطح دسترسی را برای این فایل ها تغییر دهید. (مثال: 'chmod 666 برای فایل ها' و 'chmod 777 برای شاخه ها' در سرور های مبتنی بر لینوکس,یا در سرور های مبتنی بر ویندوز properties را  برای فایل ها و مطمان شوید read-only تیک نخورده باشد)");
define("_INSTALL_L47","بعدی");

define("_INSTALL_L53","لطفا اطلاعات نوشته شده در زیر را تایید کنید:");

define("_INSTALL_L60","نمی توان بر روی فایل mainfile.php نوشت. لطفا سطح دسترسی فایل را چک کرده و دوباره امتحان کنید.");
define("_INSTALL_L61","نمی توان بر روی فایل mainfile.php نوشت. لطفا  با مسئول سرور خود تماس بگیرید.");
define("_INSTALL_L62","داده های تنظیمات با موفقیت بر روی فایل mainfile.php نوشته شد.");
define("_INSTALL_L72","شاخه های نوشته شده در ادامه باید بر روی سرور شاخته شده و قابل دسترسی برای نوشتن باشند. (مثال: 'chmod 666 برای فایل ها' و 'chmod 777 برای شاخه ها' در سرور های مبتنی بر لینوکس,یا در سرور های مبتنی بر ویندوز properties را  برای فایل ها و مطمان شوید read-only تیک نخورده باشد)");
define("_INSTALL_L73","ایمیل غیر مجاز");

// add by haruki
define("_INSTALL_L80","آشنایی");
define("_INSTALL_L81","چک کردن سطح دسترسی فایل ها");
define("_INSTALL_L82","در حال چک کردن سطح دسترسی فایل ها و شاخه ها...");
define("_INSTALL_L83","فایل %s قابل دسترسی برای نوشتن نیست.");
define("_INSTALL_L84","فایل %s قابل دسترسی برای نوشتن هست.");
define("_INSTALL_L85","شاخه %s قابل دسترسی برای نوشتن نیست.");
define("_INSTALL_L86","شاخه %s قابل دسترسی برای نوشتن هست.");
define("_INSTALL_L87","هیچ خطایی یافت نشد..");
define("_INSTALL_L89","تنظیمات اصلی");
define("_INSTALL_L90","ویژگی های اصلی");
define("_INSTALL_L91","تایید");
define("_INSTALL_L92","ذخیره تنطیمات");
define("_INSTALL_L93","اصلاح تنظیمات");
define("_INSTALL_L88","در حال ذخیره اطلاعات ویژگی ها...");
define("_INSTALL_L94","چک کردن مکان فیزیکی فایل ها و آدرس سایت");
define("_INSTALL_L127","در حال چک کردن تنظیمات مکان فیزیکی فایل ها و آدرس سایت...");
define("_INSTALL_L95","مکان فیزیکی شاخه اصلی زوپس بر روی سرور یافت نشد.");
define("_INSTALL_L96","یک ناسازگاری بین مکان فیزیکی یافت شده روی سرور  (%s) و چیزی که شما وارد کرده اید وجود دارد.");
define("_INSTALL_L97","<b>مکان فیزیکی</b> درست است.");

define("_INSTALL_L99","<b>مکان فیزیکی</b> باید یک شاخه باشد.");
define("_INSTALL_L100","<b>مکان مجازی</b> یک ادرس مجاز است.");
define("_INSTALL_L101","<b>مکان مجازی</b> یک ادرس مجاز نیست.");
define("_INSTALL_L102","تایید تنظیمات پایگاه داده");
define("_INSTALL_L103","شروع مجدد از ابتدا");
define("_INSTALL_L104","چک کردن پایگاه داده");
define("_INSTALL_L105","تلاش برای ساختن پایگاه داده");
define("_INSTALL_L106","نا توانی در اتصال به پایگاه داده در سرور.");
define("_INSTALL_L107","لطفا سرور پایگاه داده و تنظیمات آن را چک کنید.");
define("_INSTALL_L108","اتصال به سرور پایگاه داده با موفقیت انجام شد.");
define("_INSTALL_L109","پایگاه داده %s وجود ندارد.");
define("_INSTALL_L110","پایگاه داده %s وجود دارد و اتصال برقرار شده است.");
define("_INSTALL_L111","اتصال به پایگاه داده برقرار شد.<br />دکمه زیر را بزنید تا جدول ها ساخته شوند.");
define("_INSTALL_L112","تنظیمات کاربر وب مستر");
define("_INSTALL_L113","جدول %s حذف شد.");
define("_INSTALL_L114","نا توانی در ساختن جدول های پایگاه داده.");
define("_INSTALL_L115","جدول های پایگاه داده ساخته شدند.");
define("_INSTALL_L116","وارد کردن داده ها");
define("_INSTALL_L117","خاتمه");

define("_INSTALL_L118","نا توانی در ساختن جدول %s.");
define("_INSTALL_L119","ورودی های %d در جدول %s وارد شدند.");
define("_INSTALL_L120","ناتوانی در وارد کردن ورودی های %d به جدول %s.");

define("_INSTALL_L121","متغیر ثابت %s داخل %s نوشته شد.");
define("_INSTALL_L122","ناتوانی در نوشتن متغیر ثابت %s داخل %s.");

define("_INSTALL_L123","فایل %s در شاخه cache/ ذخیره شد.");
define("_INSTALL_L124","نا توانی در ذخیره فایل %s داخل شاخه cache/ .");

define("_INSTALL_L125","بر روی فایل %s فایل جدید %s نوشته شد.");
define("_INSTALL_L126","ناوتانی در نوشتن در فایل %s.");

define("_INSTALL_L130","نصب کننده جدول های زوپس نسخه 1.3.x را بر روی پایگاه داده پیدا کرد.<br />نصب کننده قصد دارد که پایگاه داده را به زوپس نسخه 2 ارتقا دهد.");
define("_INSTALL_L131","جدول های XOOPS2 در حال حاضر بر روی پایگاه داده وجود دارند.");
define("_INSTALL_L132","به روز رسانی جدول ها");
define("_INSTALL_L133","جدول %s به روز شد.");
define("_INSTALL_L134","نا توانی در به روز رسانی جدول %s.");
define("_INSTALL_L135","ناتوانی در به روز رسانی جدول های پایگاه داده.");
define("_INSTALL_L136","جدول های پایگاه داده به روز شدند.");
define("_INSTALL_L137","به روز رسانی ماژول ها");
define("_INSTALL_L138","به روز رسانی نظر ها");
define("_INSTALL_L139","به روز رسانی شکلک ها");
define("_INSTALL_L140","به روز رسانی لبخندک ها");
define("_INSTALL_L141","نصب کننده همه ماژول ها را برای کار با زوپس نسخه 2 به روز میکند.<br />مطمان شوید که تمام فایل های موجود در بسته زوپس 2 را بر روی سرور آپلود کرده اید.<br />مدتی زمان می برد تا این کار انجام شود.");
define("_INSTALL_L142","در حال به روز کردن ماژول ها...");
define("_INSTALL_L143","نصب کننده الان زوپس نسخه 1.3.x را به روز میکند تا قابل استفاده در زوپس نسخه 2 باشد.");
define("_INSTALL_L144","به روز رسانی ویژگی ها");
define("_INSTALL_L145","نظر (ID: %s) به داخل پایگاه داده وارد شد.");
define("_INSTALL_L146","نمیتوان نظر (ID: %s) را به پایگاه داده وارد کرد.");
define("_INSTALL_L147","به روز رسانی نظر ها..");
define("_INSTALL_L148","به روز رسانی به پایان رسید.");
define("_INSTALL_L149","نصب کننده الان نظر های زده شده زوپس نسخه 1.3.x را به روز میکند تا قابل استفاده در زوپس نسخه 2 باشد.<br />مدتی زمان می برد تا این کار انجام شود.");
define("_INSTALL_L150","نصب کننده الان لبخندک ها و تصاویر درجه بندی اعضا زوپس نسخه 1.3.x را به روز میکند تا قابل استفاده در زوپس نسخه 2 باشد.<br />مدتی زمان می برد تا این کار انجام شود.");
define("_INSTALL_L151","نصب کننده الان شکلک های اعضا در  زوپس نسخه 1.3.x را به روز میکند تا قابل استفاده در زوپس نسخه 2 باشد.<br />مدتی زمان می برد تا این کار انجام شود.");
define("_INSTALL_L155","در حال به روز رسانی لبخندک ها/درجه ها...");
define("_INSTALL_L156","در حال به روز رسانی شکلک های اعضا...");
define("_INSTALL_L157","پیشفرض های گروه ها را برای هر کدام از گروه ها انتخاب کنید");
define("_INSTALL_L158","گروه ها در زوپس 1.3.x");
define("_INSTALL_L159","وب مستر ها");
define("_INSTALL_L160","کاربران عضو");
define("_INSTALL_L161","کاربران مهمان");
define("_INSTALL_L162","شما باید برای هر گروهی به طور پیشفرض یکی از نوع های گروه را انتخبا کنید.");
define("_INSTALL_L163","جدول %s دراپ شد.");
define("_INSTALL_L164","خطا در حذف جدول %s.");
define("_INSTALL_L165","سایت در حال حاضر برای برخی تنظیمات بسته است لطفا بعدا مراجعه فرمایید.");

// %s is filename
define("_INSTALL_L152","نمیتوان %s را باز کرد.");
define("_INSTALL_L153","نمیتوان %s را به روز کرد.");
define("_INSTALL_L154","%s به روز شد.");

define('_INSTALL_L128', 'زبانی را که برای نصب استفاده می شود انتخاب کنید');
define('_INSTALL_L200', 'ری لود');
define("_INSTALL_L210","مرحله آخر نصب");


define('_INSTALL_CHARSET','UTF-8');

define('_INSTALL_LANG_XOOPS_SALT', "SALT");
define('_INSTALL_LANG_XOOPS_SALT_DESC', "این گزینه نقش تکمیلی را ایفا میکند در تولید کد های محرمانه و کلمات رمزی. نیازی نیست شما در حالت پیش فرض آن را تغییر دهید.");

define('_INSTALL_HEADER_MESSAGE','لطفا مراحل نصب را برای نصب کامل دانبال کنید.');
?>