<?php
// $Id: install2.php,v 1.1 2007/05/15 02:34:22 minahito Exp $
define("_INSTALL_WEBMASTER","وب مستر ها");
define("_INSTALL_WEBMASTERD","وب مستر های این سایت");
define("_INSTALL_REGUSERS","كاربران عضو");
define("_INSTALL_REGUSERSD","گروه كاربران عضو");
define("_INSTALL_ANONUSERS","كاربران مهمان");
define("_INSTALL_ANONUSERSD","گروه كاربران مهمان");

define("_INSTALL_ANON","مهمان");

define("_INSTALL_DISCLMR", "با توجه به اینکه برای وب مستر ها و مدیران سایت این امکان که پست ها را به سرعت و آسانی بازبینی کرده و موارد خلاف قواننی سایت را پاک و ویرایش کنند وجود ندارد بنابر این مسئولیت نوشته ها بر عهده نویسندگان آنهاست و از این لحاظ هیچ مسئولیتی بر گردن وب مستر ها و مدیران سایت نیست.
شما با عضویت در این سایت قبول می کنید که پست هایی که حاوی مطالب توهین آمیز ، مزخرف ،مبتذل ،افترا آمیز ،ایجاد کننده دشمنی و تهدید در سایت ،خلاف عفت و عرف عمومی جامعه باشند ننویسید.
با نوشتن هر کدام از مطالب ذکر شده شما فورا وبدون قید و شرط از سایت اخراج خواهید شد.
IP تمام پست ها ذخیره می شود تا بتوان این گونه موارد را با دقت پی گیری کرد.توجه کنید که داشتن چند شناسه برای یک کاربر ممنوع است.
شما با عضویت در این سایت موافقت می کنید که وب مستر ها مدیران و ناظران سایت در هر لحظه و با هر دلیلی عنوان ها و پست ها را ویرایش و حذف کنند و یا عنوان ها را ببندند.به عنوان یک کاربر شما موافقت می کنید که تمام نوشته های شما در دیتابیس سایت ذخیره شود ،
اگر در هر زمان اطلاعات وارد شده توسط شما در این سایت توسط افراد دیگر بدون اجازه و رضایت شما مورد سوء استفاده قرار گرفت وب مستر ها  مدیران و ناظران سایت هیچ مسئولیتی ندارند حتی اگر این اطلاعات منجر به هک شدن و یا ضررهای روحی و روانی جانی و مالی به شما شود.
سیستم این سایت از کوکی برای ذخیره اطلاعات شخصی شما در کامپیوتر شما استفاده می کند.این کوکی ها شامل اطلاعاتی که شما در سایت وارد می کنید نیست و فقط برای بهتر شدن بازدید شما در سایت استفاده می شود.
ایمیلی که برای ثبت نام وارد می کنید فقط برای دادن اطلاعات به شما و ارسال واژه رمز جدید و آگهی رسانی در مورد به روز شدن قسمت های مختلف سایت و از این قبیل مورد استفاده قرار میگیرد.

با زدن روی دکمه ثبت نام در زیر شما شرایط بالا را قبول می کنید.");
?>