<?php
// $Id: welcome.php,v 1.1 2007/05/15 02:34:22 minahito Exp $
$content =
"<u><b>XOOPS Cube چیست؟</b></u>
<p>
<b>XOOPS Cube</b> یک سیستم پویا و  OO (شیء گرا) و کد باز است که با زبان php نوشته شده است.
XOOPS Cube از چند پایگاه داده پشتبانی میکند,
استفاده از XOOPS Cube یک گزینه ایده آل برای ساختن سایت های پویای کوچک تا بزرگ بر مبانی کامیونیتی ، سایت های شرکت ها ، وب لاگ ها و مانند آن ها است.
</p>
<p>
XOOPS Cube تحت قانون کپی رایت <a href='http://www.gnu.org/copyleft/gpl.html' target='_blank'>GNU General Public License (GPL)</a> منتشر شده و استفاده از آن و دست بردن در کد های آن مجانی و مجاز است.
و میتوان آن را دوباره منتشر کرد با شرط اینکه همچنان تحت قانون GPL منتشر شود.
</p>
<u><b>نیازمندی ها</b></u>
<p>
<ul>
<li>سرور WWW(<a href='http://www.apache.org/' target='_blank'>Apache</a>, IIS, Roxen, غیره)</li>
<li><a href='http://www.php.net/' target='_blank'>PHP</a> 4.3.2 یا بالاتر (4.3.11 یا بالاتر توصیه می شود)</li>
<li><a href='http://www.mysql.com/' target='_blank'>MySQL</a> Database 3.23.XX</li>
</ul>
</p>
<u><b>قبل از نصب شما باید</b></u>
<ul>
<li>سرور WWW , PHP و سرور پایگاه داده بر روی هاست شما نصب شده باشد یا خودتان آن را انجام داده باشید.</li>
<li>یک پایگاه داده برای سایت خود بسازید.</li>
<li>یک شناسه کاربری برای پایگاه داده ای که ساخته اید بسازید و این شناسه را به پایگاه داده اختصاص دهید.</li>
<li>شاخه های uploads/, cache/ و templates_c/ و فایل mainfile.php را قابل دسترسی برای نوشتن کنید.</li>
<li>کوکی و جاوا اسکریپت را بر روی مرور گر خود فعال کنید.</li>
</ul>
<u><b>نصب</b></u>
<p>
این نصب کننده جادویی را دنبال کنید.
</p>
"
?>